# 데이터프레임 그룹 분석

In [1]:
import numpy as np
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt

import warnings
warnings.filterwarnings('ignore')

## pivot 메서드

In [ ]:
data = {
    "도시": ["서울", "서울", "서울", "부산", "부산", "부산", "인천", "인천"],
    "연도": ["2015", "2010", "2005", "2015", "2010", "2005", "2015", "2010"],
    "인구": [9904312, 9631482, 9762546, 3448737, 3393191, 3512547, 2890451, 263203],
    "지역": ["수도권", "수도권", "수도권", "경상권", "경상권", "경상권", "수도권", "수도권"]
}
columns = ["도시", "연도", "인구", "지역"]
df1 = pd.DataFrame(data, columns=columns)
df1

   도시    연도       인구   지역
0  서울  2015  9904312  수도권
1  서울  2010  9631482  수도권
2  서울  2005  9762546  수도권
3  부산  2015  3448737  경상권
4  부산  2010  3393191  경상권
5  부산  2005  3512547  경상권
6  인천  2015  2890451  수도권
7  인천  2010   263203  수도권

In [ ]:
df1.pivot(index='도시' , columns='연도' , values='인구')

연도       2005       2010       2015
도시
부산  3512547.0  3393191.0  3448737.0
서울  9762546.0  9631482.0  9904312.0
인천        NaN   263203.0  2890451.0

## 그룹 분석

In [ ]:
iris = sns.load_dataset('iris')
iris.groupby('species').mean()

            sepal_length  sepal_width  petal_length  petal_width
species
setosa             5.006        3.428         1.462        0.246
versicolor         5.936        2.770         4.260        1.326
virginica          6.588        2.974         5.552        2.026

In [ ]:
iris.groupby('species').agg(['mean', 'std'])

           sepal_length           sepal_width  ... petal_length petal_width
                   mean       std        mean  ...          std        mean       std
species                                        ...
setosa            5.006  0.352490       3.428  ...     0.173664       0.246  0.105386
versicolor        5.936  0.516171       2.770  ...     0.469911       1.326  0.197753
virginica         6.588  0.635880       2.974  ...     0.551895       2.026  0.274650

[3 rows x 8 columns]

In [2]:
np.random.seed(0)
df2 = pd.DataFrame({
    'key1': ['A', 'A', 'B', 'B', 'A'],
    'key2': ['one', 'two', 'one', 'two', 'one'],
    'data1': [1, 2, 3, 4, 5],
    'data2': [10, 20, 30, 40, 50]
})
df2

  key1 key2  data1  data2
0    A  one      1     10
1    A  two      2     20
2    B  one      3     30
3    B  two      4     40
4    A  one      5     50

In [4]:
df2.groupby(df2.key1).sum()

      data1  data2
key1
A         8     80
B         7     70

In [5]:
df2.groupby(df2.key1)['data2'].sum()

key1
A    80
B    70
Name: data2, dtype: int64

In [9]:
df2.data2.groupby(df2.key1).sum()

key1
A    80
B    70
Name: data2, dtype: int64

In [7]:
for k in df2.groupby('key1').groups:
    print(k)

A
B

### agg() 메서드 적용

In [13]:
iris = sns.load_dataset('iris')

In [19]:
def peak_to_peak_ratio(x):
    return x.max() / x.min()

In [20]:
iris.groupby(iris.species).agg(peak_to_peak_ratio)

            sepal_length  sepal_width  petal_length  petal_width
species
setosa          1.348837     1.913043      1.900000     6.000000
versicolor      1.428571     1.700000      1.700000     1.800000
virginica       1.612245     1.727273      1.533333     1.785714

In [21]:
iris.groupby(iris.species).agg(lambda x : x.max() - x.min())

            sepal_length  sepal_width  petal_length  petal_width
species
setosa               1.5          2.1           0.9          0.5
versicolor           2.1          1.4           2.1          0.8
virginica            3.0          1.6           2.4          1.1

In [22]:
iris.groupby(iris.species).apply(peak_to_peak_ratio)

            sepal_length  sepal_width  petal_length  petal_width
species
setosa          1.348837     1.913043      1.900000     6.000000
versicolor      1.428571     1.700000      1.700000     1.800000
virginica       1.612245     1.727273      1.533333     1.785714

In [26]:
iris.groupby(iris.species).describe().T.round(3)

species             setosa  versicolor  virginica
sepal_length count  50.000      50.000     50.000
             mean    5.006       5.936      6.588
             std     0.352       0.516      0.636
             min     4.300       4.900      4.900
             25%     4.800       5.600      6.225
             50%     5.000       5.900      6.500
             75%     5.200       6.300      6.900
             max     5.800       7.000      7.900
sepal_width  count  50.000      50.000     50.000
             mean    3.428       2.770      2.974
             std     0.379       0.314      0.322
             min     2.300       2.000      2.200
             25%     3.200       2.525      2.800
             50%     3.400       2.800      3.000
             75%     3.675       3.000      3.175
             max     4.400       3.400      3.800
petal_length count  50.000      50.000     50.000
             mean    1.462       4.260      5.552
             std     0.174       0.470      0.552
             min     1.000       3.000      4.500
             25%     1.400       4.000      5.100
             50%     1.500       4.350      5.550
             75%     1.575       4.600      5.875
             max     1.900       5.100      6.900
petal_width  count  50.000      50.000     50.000
             mean    0.246       1.326      2.026
             std     0.105       0.198      0.275
             min     0.100       1.000      1.400
             25%     0.200       1.200      1.800
             50%     0.200       1.300      2.000
             75%     0.300       1.500      2.300
             max     0.600       1.800      2.500

In [28]:
mpg = sns.load_dataset('mpg')
mpg.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 398 entries, 0 to 397
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   mpg           398 non-null    float64
 1   cylinders     398 non-null    int64
 2   displacement  398 non-null    float64
 3   horsepower    392 non-null    float64
 4   weight        398 non-null    int64
 5   acceleration  398 non-null    float64
 6   model_year    398 non-null    int64
 7   origin        398 non-null    object
 8   name          398 non-null    object
dtypes: float64(4), int64(3), object(2)
memory usage: 28.1+ KB

In [31]:
mpg['manufacture'] = mpg['name'].apply(lambda x : x.split()[0])
mpg['model'] = mpg['name'].apply(lambda x : ' '.join(x.split()[1:]))
mpg[['name', 'manufacture', 'model']].head()

                        name manufacture            model
0  chevrolet chevelle malibu   chevrolet  chevelle malibu
1          buick skylark 320       buick      skylark 320
2         plymouth satellite    plymouth        satellite
3              amc rebel sst         amc        rebel sst
4                ford torino        ford           torino

In [33]:
mpg.groupby(mpg.manufacture).groups

{'amc': [3, 9, 16, 24, 33, 37, 45, 66, 72, 86, 96, 99, 107, 127, 134, 140, 162, 169, 176, 189, 194, 202, 257, 261, 283, 296, 315, 374], 'audi': [21, 119, 141, 177, 274, 317, 327], 'bmw': [23, 242], 'buick': [1, 13, 68, 85, 95, 137, 160, 164, 217, 226, 258, 263, 289, 305, 339, 363, 386], 'cadillac': [212, 298], 'capri': [184], 'chevroelt': [161], 'chevrolet': [0, 6, 12, 30, 35, 38, 46, 60, 62, 73, 87, 91, 98, 103, 109, 115, 128, 132, 133, 153, 157, 165, 187, 192, 195, 196, 221, 225, 230, 237, 253, 262, 266, 285, 291, 306, 311, 313, 341, 367, 368, 369, 392], 'chevy': [26, 213, 397], 'chrysler': [70, 94, 231, 292, 366, 388], 'datsun': [18, 29, 54, 81, 110, 129, 145, 173, 204, 220, 241, 247, 268, 273, 303, 312, 320, 324, 333, 347, 357, 362, 385], 'dodge': [10, 27, 42, 58, 83, 89, 121, 138, 146, 185, 188, 199, 215, 223, 238, 250, 260, 265, 269, 284, 288, 295, 316, 323, 340, 371, 391, 395], 'fiat': [52, 114, 117, 147, 148, 151, 182, 304], 'ford': [4, 5, 17, 25, 32, 36, 40, 43, 48, 61, 65, 74, 80, 88, 92, 100, 104, 112, 126, 130, 136, 139, 155, 159, 166, 168, 174, 190, 193, 200, 206, 214, 228, 232, 236, 245, 254, 255, 264, 282, 286, 290, 314, 336, 351, 352, 365, 373, 389, 393, 396], 'hi': [28], 'honda': [149, 181, 198, 216, 248, 279, 329, 337, 345, 355, 381, 383, 384], 'maxda': [111, 294], 'mazda': [71, 243, 246, 319, 322, 334, 349, 358, 376, 377], 'mercedes': [297], 'mercedes-benz': [211, 328], 'mercury': [49, 67, 90, 113, 154, 224, 251, 259, 281, 287, 379], 'nissan': [380], 'oldsmobile': [69, 106, 124, 222, 249, 272, 300, 307, 364, 387], 'opel': [50, 118, 143, 183], 'peugeot': [20, 51, 78, 178, 209, 277, 299, 359], 'plymouth': [2, 7, 11, 15, 34, 41, 56, 64, 75, 93, 97, 101, 105, 125, 135, 152, 158, 163, 191, 208, 219, 227, 256, 271, 301, 302, 338, 342, 344, 350, 378], 'pontiac': [8, 39, 44, 47, 63, 116, 156, 170, 201, 229, 234, 252, 280, 308, 370, 372], 'renault': [79, 186, 218, 330, 354], 'saab': [22, 122, 180, 276], 'subaru': [150, 239, 331, 346], 'toyota': [14, 31, 53, 57, 84, 108, 123, 131, 144, 167, 171, 205, 210, 235, 267, 270, 310, 318, 321, 343, 348, 356, 361, 382, 390], 'toyouta': [82], 'triumph': [335], 'vokswagen': [332], 'volkswagen': [19, 55, 59, 77, 102, 142, 172, 175, 203, 233, 240, 244, 278, 353, 375], 'volvo': [76, 120, 179, 207, 275, 360], 'vw': [197, 293, 309, 325, 326, 394]}

In [40]:
for maker, idx in mpg.groupby(mpg.manufacture).groups.items():
    print(maker, len(idx), end='   ')

amc 28   audi 7   bmw 2   buick 17   cadillac 2   capri 1   chevroelt 1   chevrolet 43   chevy 3   chrysler 6   datsun 23   dodge 28   fiat 8   ford 51   hi 1   honda 13   maxda 2   mazda 10   mercedes 1   mercedes-benz 2   mercury 11   nissan 1   oldsmobile 10   opel 4   peugeot 8   plymouth 31   pontiac 16   renault 5   saab 4   subaru 4   toyota 25   toyouta 1   triumph 1   vokswagen 1   volkswagen 15   volvo 6   vw 6

## pivot_table

In [41]:
data = {
    "도시": ["서울", "서울", "서울", "부산", "부산", "부산", "인천", "인천"],
    "연도": ["2015", "2010", "2005", "2015", "2010", "2005", "2015", "2010"],
    "인구": [9904312, 9631482, 9762546, 3448737, 3393191, 3512547, 2890451, 263203],
    "지역": ["수도권", "수도권", "수도권", "경상권", "경상권", "경상권", "수도권", "수도권"]
}
columns = ["도시", "연도", "인구", "지역"]
df1 = pd.DataFrame(data, columns=columns)
df1

   도시    연도       인구   지역
0  서울  2015  9904312  수도권
1  서울  2010  9631482  수도권
2  서울  2005  9762546  수도권
3  부산  2015  3448737  경상권
4  부산  2010  3393191  경상권
5  부산  2005  3512547  경상권
6  인천  2015  2890451  수도권
7  인천  2010   263203  수도권

In [42]:
df1.pivot(index='도시', columns='연도', values='인구')

연도       2005       2010       2015
도시
부산  3512547.0  3393191.0  3448737.0
서울  9762546.0  9631482.0  9904312.0
인천        NaN   263203.0  2890451.0

In [43]:
df1.pivot_table(index='도시', columns='연도', values='인구')

연도       2005       2010       2015
도시
부산  3512547.0  3393191.0  3448737.0
서울  9762546.0  9631482.0  9904312.0
인천        NaN   263203.0  2890451.0

In [44]:
df1.pivot_table(index='도시', columns='연도', values='인구', margins=True, margins_name='합계')

연도       2005       2010       2015            합계
도시
부산  3512547.0  3393191.0  3448737.0  3.451492e+06
서울  9762546.0  9631482.0  9904312.0  9.766113e+06
인천        NaN   263203.0  2890451.0  1.576827e+06
합계  6637546.5  4429292.0  5414500.0  5.350809e+06

In [45]:
df1.pivot_table(index=['지역','도시'], columns='연도', values='인구', margins=True, margins_name='합계')

연도           2005       2010       2015            합계
지역  도시
경상권 부산  3512547.0  3393191.0  3448737.0  3.451492e+06
수도권 서울  9762546.0  9631482.0  9904312.0  9.766113e+06
    인천        NaN   263203.0  2890451.0  1.576827e+06
합계      6637546.5  4429292.0  5414500.0  5.350809e+06

### tips dataset 사례

In [47]:
tips = sns.load_dataset('tips')
tips.info()
tips.head(3)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 244 entries, 0 to 243
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   total_bill  244 non-null    float64
 1   tip         244 non-null    float64
 2   sex         244 non-null    category
 3   smoker      244 non-null    category
 4   day         244 non-null    category
 5   time        244 non-null    category
 6   size        244 non-null    int64
dtypes: category(4), float64(2), int64(1)
memory usage: 7.3 KB

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3

In [49]:
tips['tip_pct'] = np.round(tips.tip / tips.total_bill * 100, 2)

In [51]:
tips.describe().round(3)

       total_bill      tip     size  tip_pct
count     244.000  244.000  244.000  244.000
mean       19.786    2.998    2.570   16.080
std         8.902    1.384    0.951    6.107
min         3.070    1.000    1.000    3.560
25%        13.348    2.000    2.000   12.910
50%        17.795    2.900    2.000   15.475
75%        24.127    3.562    3.000   19.148
max        50.810   10.000    6.000   71.030

In [63]:
# 성별, 흡연 여부에 따른 평균 팁 비욜
tips.pivot_table(index='sex', columns='smoker', values='tip_pct').round(2)

smoker    Yes     No
sex
Male    15.28  16.07
Female  18.21  15.69

In [68]:
tips.pivot_table(index=['sex','smoker'], values='tip_pct').round(2)

               tip_pct
sex    smoker
Male   Yes       15.28
       No        16.07
Female Yes       18.21
       No        15.69

In [67]:
tips.groupby(['sex','smoker'])[['tip_pct']].mean().round(2)

               tip_pct
sex    smoker
Male   Yes       15.28
       No        16.07
Female Yes       18.21
       No        15.69

In [62]:
tips.groupby('sex')[['tip_pct']].mean()

          tip_pct
sex
Male    15.764713
Female  16.648276

In [64]:
tips.groupby('smoker')[['tip_pct']].mean()

          tip_pct
smoker
Yes     16.319140
No      15.932318

In [58]:
tips.groupby('sex').count()

        total_bill  tip  smoker  day  time  size  tip_pct
sex
Male           157  157     157  157   157   157      157
Female          87   87      87   87    87    87       87

In [60]:
# Nan 데이터가 없을 때
tips.groupby('sex').size()

sex
Male      157
Female     87
dtype: int64

In [69]:
#팁의 비율이 요일과 점심/저녁 여부, 인원수에 어떤 영향을 받는지 살펴본다
# 어떤 요인이 가장 크게 작용하는지 판단할 수 있는 방법이 있는가?

tips.pivot_table(index='day', columns=['time','size'], values='tip_pct').round(2)

time  Lunch                             ... Dinner
size      1     2      3      4      5  ...      2      3      4      5      6
day                                     ...
Thur  18.17  16.4  14.46  14.55  12.14  ...  15.97    NaN    NaN    NaN    NaN
Fri   22.38  18.2  18.77    NaN    NaN  ...  16.27    NaN  11.77    NaN    NaN
Sat     NaN   NaN    NaN    NaN    NaN  ...  15.53  15.14  13.83  10.66    NaN
Sun     NaN   NaN    NaN    NaN    NaN  ...  18.09  15.27  15.32  15.99  10.38

[4 rows x 12 columns]

In [71]:
# 요일
tips.groupby('day')[['tip_pct']].mean().round(2)

      tip_pct
day
Thur    16.13
Fri     16.99
Sat     15.31
Sun     16.69

In [72]:
tips.groupby('time')[['tip_pct']].mean().round(2)

        tip_pct
time
Lunch     16.41
Dinner    15.95

In [74]:
tips.groupby(['day','time'])[['tip_pct']].mean().round(2)

             tip_pct
day  time
Thur Lunch     16.13
     Dinner    15.97
Fri  Lunch     18.88
     Dinner    15.89
Sat  Lunch       NaN
     Dinner    15.31
Sun  Lunch       NaN
     Dinner    16.69

In [75]:
tips.pivot_table(index='time', columns='day', values='tip_pct').round(2)

day      Thur    Fri    Sat    Sun
time
Lunch   16.13  18.88    NaN    NaN
Dinner  15.97  15.89  15.31  16.69

In [77]:
tips.pivot_table(columns=['day'], index=['time','size'], values='tip_pct').round(2)

day           Thur    Fri    Sat    Sun
time   size
Lunch  1     18.17  22.38    NaN    NaN
       2     16.40  18.20    NaN    NaN
       3     14.46  18.77    NaN    NaN
       4     14.55    NaN    NaN    NaN
       5     12.14    NaN    NaN    NaN
       6     17.37    NaN    NaN    NaN
Dinner 1       NaN    NaN  23.18    NaN
       2     15.97  16.27  15.53  18.09
       3       NaN    NaN  15.14  15.27
       4       NaN  11.77  13.83  15.32
       5       NaN    NaN  10.66  15.99
       6       NaN    NaN    NaN  10.38

In [78]:
tips.head()

   total_bill   tip     sex smoker  day    time  size  tip_pct
0       16.99  1.01  Female     No  Sun  Dinner     2     5.94
1       10.34  1.66    Male     No  Sun  Dinner     3    16.05
2       21.01  3.50    Male     No  Sun  Dinner     3    16.66
3       23.68  3.31    Male     No  Sun  Dinner     2    13.98
4       24.59  3.61  Female     No  Sun  Dinner     4    14.68

In [79]:
# 어떤 요인이 가장 크게 작용했다고 생각하는가?
tips.groupby(['sex','smoker'])[['tip_pct']].agg(lambda x : x.max()/x.min())

                 tip_pct
sex    smoker
Male   Yes     19.952247
       No       4.066852
Female Yes      7.388298
       No       4.448944

In [80]:
def peak2peak(x):
    return x.max() / x.min()

In [81]:
tips.groupby(['sex','smoker'])[['tip_pct']].agg(['mean','std', peak2peak])

                 tip_pct
                    mean       std  peak2peak
sex    smoker
Male   Yes     15.276667  9.058490  19.952247
       No      16.066598  4.184634   4.066852
Female Yes     18.214545  7.159585   7.388298
       No      15.691111  3.641717   4.448944